<template>
  <section class="main farro-light">
    <div class="main-container">
      <h2>О нас</h2>

      <div class="info">
        <p>На сервере BixLand царила атмосфера полной разрозненности. Хотя на его просторах существовали десятки различных городов и поселений, каждый из них действовал по своим собственным законам и правилам. Города строили оборону, защищая свои ресурсы и территории, в то время как мелкие поселения жили в тени, часто оставаясь беззащитными. В таких условиях, каждый игрок становился в первую очередь сам за себя. Несмотря на наличие торговых маршрутов и некоторых попыток сотрудничества, ресурсов было недостаточно, а торговли между разными группами часто нарушались из-за неорганизованности. Независимые игроки предпочитали оставаться вне крупных кланов, но и они сталкивались с трудностями: отсутствие защиты и поддержки, а также несправедливое распределение ресурсов вынуждали многих покидать сервер. Новички, появляясь на BixLand, быстро сталкивались с жестокой реальностью и зачастую не могли выжить без объединения с более сильными игроками. Система была порочной, и возникала необходимость в переменах, которые могли бы решить проблему разобщенности и привести сервер к процветанию.</p>

        <div class="persons">
          <div class="person">
            <p>В этот период, когда ситуация на сервере становилась всё более нестабильной, на BixLand появились три ключевые фигуры, чьи действия в будущем изменят ход истории. Первым был Baha_ZXC, одиночка, который много времени проводил в путешествиях по серверу. Он не строил огромные базы, как многие другие, а вместо этого исследовал мир, находя слабые места в существующих структурах и понимая, где необходимы перемены. Baha_ZXC видел, как из-за отсутствия координации многие поселения и города страдают от внутренних конфликтов и неэффективности. Его знания о мире и проблемах сервера позволяли ему предсказать, что для развития необходима общая структура, объединяющая всех игроков.</p>
            <img src="../assets/images/image 2.png" alt="">
          </div>
          <div class="person">
            <p>Вторым был DetGeto, лидер крупной торговой сети, охватывавшей как большие города, так и маленькие поселения. Он управлял экономикой BixLand, но видел, что даже несмотря на его усилия, отсутствие единой системы лишь тормозило развитие. Торговля, которая могла бы приносить выгоду всем, страдала от разрозненности, а без стабильных путей для обмена ресурсами многие игроки не могли получить то, что им было нужно. DetGeto знал, что без организации, способной регулировать обмен и обеспечивать стабильность, сервер никогда не достигнет процветания.</p>
            <img src="../assets/images/zombiemask-1200x1200 1.png" alt="">
          </div>
          <div class="person">
            <p>Третьей была 26052003lll, молодая и амбициозная лидерша, которая возглавляла несколько небольших поселений и объединений. Она была стратегом, стремившимся создать на BixLand систему, в которой бы учитывались интересы всех игроков, даже самых маленьких поселений. Её организация была центром для всех, кто не мог вступить в крупные кланы, но стремился к развитию и защите своих интересов. 26052003lll была уверена, что для стабильности и процветания сервера необходимо, чтобы каждый имел возможность влиять на его развитие, и что голос каждого, независимо от размера поселения или клана, должен быть услышан.</p>
            <img src="../assets/images/image 3.png" alt="">
          </div>
        </div>

        <p>Вскоре стало ясно, что для решения проблемы разрозненности на BixLand необходима глобальная организация, которая бы объединяла все фракции и игроков, независимо от их силы или положения. Вдохновлённые идеей мира и сотрудничества, три лидера решили создать аналог реальной ООН, которая бы обеспечивала стабильность и поддерживала порядок на сервере.<br><br><span>Baha_ZXC</span>, с его знаниями о мире и его слабых местах, предложил создать структуру, которая могла бы регулировать взаимодействие между городами и поселениями, обеспечивая нейтральную платформу для решения всех конфликтов и споров. Он считал, что создание ООН позволит предотвратить разрушительные войны и создать условия для развития, обеспечивая мир и стабильность для всех игроков.<br><br><span>DetGeto</span>, как лидер торговой сети, предложил внести в новую организацию элементы экономического контроля. Он знал, что для процветания сервера необходимо наладить эффективную систему обмена ресурсами, и предложил, чтобы ООН обеспечивала справедливое распределение ресурсов между различными группами и фракциями. Он также настаивал на создании единой торговой платформы, которая позволила бы всем участникам обмениваться ресурсами безопасно и с соблюдением единого набора правил.<br><br><span>26052003lll</span>, как стратег, предложила, чтобы в рамках ООН каждому игроку, независимо от его статуса, был предоставлен равный голос. Она разработала стратегический план, который предусматривал создание системы, позволяющей эффективно защищать интересы всех фракций и урегулировать внутренние конфликты. Она также предложила внедрить план действий для реагирования на возможные угрозы, чтобы обеспечить безопасность и стабильность на сервере.</p>
      </div>

      <div class="conclusion">
        <p>Создание ООН на BixLand стало поворотным моментом для всего сервера. С объединением усилий трёх ключевых лидеров, удалось выработать систему, которая обеспечивала справедливость и стабильность для всех игроков, независимо от их силы или положения. С введением общего законодательства, торговли и стратегического планирования, сервер перешёл к новому этапу развития, где каждый игрок мог участвовать в принятии решений и иметь защиту от внешних и внутренних угроз.<br>Созданная ООН позволила наладить эффективное сотрудничество между фракциями, предотвратить многочисленные конфликты и повысить уровень безопасности для всех участников. Торговля, урегулированная едиными правилами, позволила серверу процветать экономически, а система голосования обеспечила участие каждого в решении важных вопросов. Благодаря стратегическим мерам и планированию, BixLand стал местом, где можно было не только строить и развиваться, но и быть уверенным в поддержке со стороны единой организации.<br>Так, в итоге, ООН на BixLand стала основой для стабильности, прогресса и долгосрочного развития, обеспечив всем игрокам возможность быть частью чего-то большего и важного для всего сервера.</p>
      </div>
    </div>
  </section>
</template>

<style lang="less" scoped>
  .main {

    & .main-container {
      margin: 0px 100px;
      & > h2 {
        font-weight: 700;
        font-size: 40px;
        color: #7F7F7F;
      }
      
      & .info {
        margin-top: 10px;
        & > p {
          font-size: 18px;
          line-height: 30px;
          
          & > span {
            color: red;
          }
        }
        
        & .persons {
          margin-top: 150px;
          display: flex;
          justify-content: center;
          flex-wrap: wrap;
          
          & .person {
            margin-bottom: 60px;
            display: flex;
            justify-content: space-between;
            align-items: center;
            
            & > img {
            }
            
            & > p {
              width: 70%;
              font-size: 18px;
            }
          }
        }
      }
      & .conclusion {
        margin-top: 100px;
        
        & > p {
          font-size: 18px;
        }
      }
      @media (max-width: 600px) {
        margin: 0px 10px;
      
        & .title {
          font-weight: 700;
          font-size: 30px;
          color: #7F7F7F;
        }
  
        & .info {
          margin-top: 10px;
          
          & > p {
            font-size: 18px;
            line-height: 27px;
  
            & > span {
              color: red;
            }
          }
  
          & .persons {
            margin-top: 100px;
            display: flex;
            justify-content: center;
            flex-wrap: wrap;
  
            & .person {
              margin-bottom: 30px;
              display: flex;
              justify-content: space-between;
              align-items: center;
  
              & > img {
                display: none;
              }
  
              & > p {
                width: 100%;
                font-size: 18px;
              }
            }
          }
        }
        & .conclusion {
          margin-top: 100px;
  
          & > p {
            font-size: 18px;
          }
        }
      }
    }
  }
</style>