<template>
  <section class="main farro-light">
    <div class="main-container">
      <h2>Правила</h2>
      <div class="rules">
        <p>Организация Объединённых Наций, [13.12.2024 14:11]
          ООН это организация которая отвечает за поддержание мира и безопасности на планете; развитие дружественных
          отношений между странами; сотрудничество в решении международных проблем и в обеспечении уважения прав
          человека; и согласование действий разных стран.

          Уставы и законы ООН

          <br><br><span>1.1</span> Запрещено работать во вред ООН.
          Наказание изгнание из ООН или штраф 200.000

          <br><br><span>1.2</span> Запрещено убивать мирных игроков или новичков или же членов ООН.
          Штраф: 20.000-60.000 предупреждение 0/3

          <br><br><span>1.3</span> Уважение ко всем: Будьте вежливы, уважайте других игроков и их мнение. Оскорбления,
          угрозы и токсичное
          поведение запрещены.
          Штраф: 5.000

          <br><br><span>1.4</span> Запрет на дискриминацию: Любая форма расизма, сексизма, гомофобии или другой
          дискриминации строго
          запрещена.
          Штраф: 5.000

          <br><br><span>1.5</span> Решение конфликтов: Все споры разрешаются мирным путем. Если возникла проблема,
          обратитесь к старшим
          членам ООН. При необходимости проблема может решиться в зале ООН.

          <br><br><span>1.6</span> Честная игра: Не разрушайте чужие постройки, не воруйте предметы и не убивайте
          игроков без их согласия
          Штраф: 15.000-50.000 предупреждение 0/3

          <br><br><span>1.7</span> Честная торговля: Взаимодействие с экономикой сервера должно быть прозрачным и
          справедливым. Обман в
          сделках запрещен.
          Штраф: 20.000

          <br><br><span>1.8</span> Уважение к ресурсам: Не выкапывайте ресурсы в чужих территориях без разрешения.
          Используйте природные
          ресурсы ответственно.
          Штраф: 5.000

          <br><br><span>1.9</span> Уважение к постройкам:
          разрушайте постройки других игроков.
          Штраф: 10.000

          <br><br><span>2.1</span> Уважение границ: Не стройте слишком близко к чужим постройкам без согласия.
          Штраф: 10.000

          <br><br><span>2.2</span> Запрет на спам: Не засоряйте чат бессмысленными сообщениями, капсом или рекламой.

          <br><br><span>2.3</span> Подчинение старшим членам ООН: Соблюдайте указания генералов и основателя (маршала).
          Штраф: 5.000

          <br><br><span>2.4</span> Обратная связь: Сообщайте о нарушениях, проблемах и предложениях для улучшения
          альянса.

          <br><br><span>2.5</span> Запрет на подделку: Не выдавайте себя за старших или других игроков.
          Штраф: 15.000

          <br><br><span>2.6</span> Ответственное потребление: Не оставляйте за собой вырубленные леса или заброшенные
          шахты. Засаживайте
          деревья после вырубки.
          Штраф: 5.000

          <br><br><span>2.7</span> Защита природы: Запрещено загрязнять игровые реки и озёра (например, оставлять лаву,
          мусор из блоков).
          Штраф: 5.000

          <br><br><span>2.8</span> Помощь нуждающимся: Помогайте игрокам, попавшим в трудную ситуацию (например, после
          нападения мобов или
          случайной потери ресурсов).

          <br><br><span>2.9</span> Личные границы: Уважайте частные владения игроков. Проникновение на чужие территории
          без разрешения
          запрещено.
          Штраф: 5.000

          <br><br><span>3.1</span> Защита новичков: Новичков нельзя атаковать или обманывать
          Штраф: 20.000

          <br><br><span>3.2</span> Фонды развития: Организуйте специальные фонды, которые будут использоваться для
          строительства общественных
          зданий, или для общих целей ООН.

          <br><br><span>3.3</span> Разоружение: Ограничьте использование взрывчатки (ТНТ) или других разрушительных
          механизмов.
          Штраф: 60.000

          <br><br><span>3.4</span> Запрет агрессии: Нападения между игроками или группами разрешены только по взаимному
          согласию или в рамках
          объявленных войн, или же решить этот вопрос мирным дипломатическим путем через членов ООН.
          Штраф: 40.000 предупреждение 0/3

          <br><br><span>3.5</span> Оптимизация ресурсов: Строительство больших объектов должно быть согласовано со
          старшами членами ООН,
          чтобы избежать лагов.
          Штраф: 5.000

          <br><br><span>3.6</span> Посольства: Каждая группа игроков может построить свое посольство или
          представительство.

          <br><br><span>3.7</span> Культурные обмены: Игроки могут делиться ресурсами, архитектурными идеями.

          <br><br><span>3.8</span> Запрещено использовать лавы, и разжигать огни в лесах.
          Штраф: 10.000

          <br><br><span>3.9</span> Мировой суд: Игрокам предоставляется шанс обжаловать наказание перед судом.

          <br><br><span>4.1</span> Улучшения инфраструктуры.

          <br><br><span>4.2</span> Военные действия допускаются только после дипломатических попыток урегулирования
          конфликта.

          <br><br><span>4.3</span> Организация гуманитарных миссий (поставка еды, материалов или помощи) осуществляется
          под эгидой ООН.

          <br><br><span>4.4</span> Все договоры между странами (игроками/группами) должны быть зарегистрированы в
          "Генеральной Ассамблее"
          (специальной игровой книге)

          <br><br><span>4.5</span> Провокация между городами и попытка открыть Военных Действий между городами
          запрещены.
          Штраф: 50.000 предупреждение 0/3

          <br><br><span>4.6</span> Все игроки обязаны подчиняться решениям Совета Безопасности, связанным с
          предотвращением конфликтов.
          Штраф: 20.000 предупреждение 0/3

          Организация Объединённых Наций, [13.12.2024 14:11]
          <br><br><span>4.7</span> Перед началом строительства крупных объектов игроки обязаны получить разрешение от
          Совета по культуре
          ЮНЕСКО.

          <br><br><span>4.8</span> Каждая страна или группа игроков может отправить одного делегата для участия в
          заседаниях.

          <br><br><span>4.9</span> Все обсуждения и голосования в рамках ООН должны проходить в зале ООН.

          Организация Объединённых Наций, [13.12.2024 14:11]
          <br><br><span>5.1</span> ООН обязана регулярно проводить собрания для оценки текущего состояния мира и
          обсуждения новых правил.

          <br><br><span>5.2</span> ООН имеет право наложить санкции на страну, если она игнорирует выполнение глобальных
          целей.

          <br><br><span>5.3</span> Каждая страна обязана выделять часть ресурсов на выполнение "глобальных целей
          устойчивого развития"

          <br><br><span>5.4</span> Генеральный секретарь и заместитель генерального секретаря имеют право созывать
          экстренные заседания зала
          ООН для быстрого принятия решений.

          <br><br><span>5.5</span> ООН может использовать "резервы ресурсов" для общей цели.

          <br><br><span>5.6</span> Незаконные войны ведут к санкциям, включая запрет на торговлю и поддержку со стороны
          других игроков.

          <br><br><span>5.7</span> ООН имеет права объявить рейд при необходимости.

          <br><br><span>5.8</span> Каждая страна или группа игроков обязана заявлять о своей добыче редких ресурсов в
          Экономический совет.

          <br><br><span>5.9</span> Все игроки имеют право подавать жалобы на нарушение своих прав (например, нападения,
          мошенничество или
          несправедливые действия со стороны других игроков).

          <br><br><span>6.1</span> Все сделки с редкими ресурсами должны быть зарегистрированы в глобальном реестре ООН
          для обеспечения
          справедливости.

          <br><br><span>6.2</span> ООН следит за соблюдением прав всех игроков, включая новичков, с целью обеспечения
          справедливости и
          безопасности.

          <br><br><span>6.3</span> Жалобы рассматриваются в Совете по правам человека, и решения принимаются на основе
          фактов и
          доказательств.

          <br><br><span>6.4</span> Игроки, нарушившие права других игроков, могут быть подвергнуты наказанию.
          Штраф: 10.000-50.000

          <br><br><span>6.5</span> Все мирные переговоры между игроками, группами или странами должны проводиться в
          присутствии
          представителей ООН или дипломатических посредников.

          <br><br><span>6.6</span> Переговоры должны быть мирными, с целью установления взаимных соглашений и разрешения
          конфликтов без
          насилия.

          <br><br><span>6.7</span> Во время переговоров запрещено использование агрессии или угроз — любые попытки
          давления могут привести к
          санкциям.

          <br><br><span>6.8</span> Результаты переговоров должны быть официально записаны в книге ООН.

          <br><br><span>6.9</span> ООН следит за соблюдением этих норм и разрабатывает систему проверок для обеспечения
          честности и
          безопасности игрового процесса.

          <br><br><span>7.1</span> При не соблюдении правил игроки получат штраф или предупреждение.

          <br><br><span>7.2</span> Запрещена трапка в любом виде за это грозит большое наказание.
          Штраф: 60.000 предупреждение 0/3

          <br><br><span>7.3</span> Если имеется лишние деньги то рекомендуется ложить эти деньги в казну ООН для общей
          глобальное цели,
          благо, и миротврении.
          А деньги из штрафов игроков обязательно ложить в казну ООН.

          <br><br><span>7.4</span> Убийство обманным путём запрещена. Например: используется тп и там визер или т.п и
          т.д.
          Штраф: 50.000 предупреждение 0/3
        </p>
      </div>
    </div>
  </section>
</template>

<style lang="less" scoped>
  .main {

    & .main-container {
      margin: 0 100px;
      & > h2 {
        font-weight: 700;
        font-size: 40px;
        color: #7F7F7F;
      }

      & .rules {

        & > p {

          & > span {
            color: red;
            font-size: 20px;
          }
        }
      }

      @media (max-width: 600px) {
        margin: 0 10px;
      }
    }
  }
</style>